
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7785458967)


<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_project.default
  * google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]
  * google_vpc_access_connector.internal-vpc-connector
* Update
  * google_artifact_registry_repository.artifact-repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project.default will be created
  + resource "google_project" "default" {
      + auto_create_network = true
      + billing_account     = "01CE72-2CA1C6-0D39D7"
      + effective_labels    = {
          + "firebase" = "enabled"
        }
      + id                  = (known after apply)
      + labels              = {
          + "firebase" = "enabled"
        }
      + name                = "ikigaikintore"
      + number              = (known after apply)
      + project_id          = "gig-japan-398904"
      + skip_delete         = (known after apply)
      + terraform_labels    = {
          + "firebase" = "enabled"
        }
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be created
  + resource "google_project_service" "firebase_apis" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "firebase.googleapis.com"
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "firebase_apis" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "serviceusage.googleapis.com"
    }

  # google_vpc_access_connector.internal-vpc-connector will be created
  + resource "google_vpc_access_connector" "internal-vpc-connector" {
      + connected_projects = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.5.5.0/28"
      + machine_type       = "f1-micro"
      + max_instances      = 4
      + max_throughput     = 500
      + min_instances      = 2
      + min_throughput     = 200
      + name               = "vpc-connector"
      + network            = "projects/gig-japan-398904/global/networks/int-vpc"
      + project            = "gig-japan-398904"
      + region             = "asia-northeast1"
      + self_link          = (known after apply)
      + state              = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":43,"Program":"tfcmt","SHA1":"7df0b68e14022ca5dcd6503838e2a14da638b9e6","Vars":{},"WorkflowName":"iaac_plan"} -->